Examples/Flat_plate_at_angle_of_attack/OpenFOAM/supersonicPlate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (987.752 356.236 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (987.752 356.236 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (987.752 356.236 0);
    }
    top
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    plate_bottom
    {
        type            slip;
    }
    plate_top
    {
        type            slip;
    }
}


// ************************************************************************* //
