Examples/Flat_plate_at_angle_of_attack/OpenFOAM/supersonicPlate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(

//  Z= 0.0

// Bottom
    ( -5.5     -5.0     0.0) //0
    ( 0.5     -5.0     0.0) //1
    ( 1.5     -5.0     0.0) //2
    ( 5.0     -5.0     0.0) //3

// Center (Plate)
    ( -5.5      0.0     0.0) //4
    ( 0.5      0.0     0.0) //5
    ( 1.5      0.0     0.0) //6
    ( 5.0      0.0     0.0) //7

// Top
    ( -5.5      5.0     0.0) //8
    ( 0.5      5.0     0.0) //9
    ( 1.5      5.0     0.0) //10
    ( 5.0      5.0     0.0) //11

// Z= 0.1
    ( -5.5     -5.0     0.1) //12
    ( 0.5     -5.0     0.1) //13
    ( 1.5     -5.0     0.1) //14
    ( 5.0     -5.0     0.1) //15

    ( -5.5      0.0     0.1) //16
    ( 0.5      0.0     0.1) //17
    ( 1.5      0.0     0.1) //18
    ( 5.0      0.0     0.1) //19

    ( -5.5      5.0     0.1) //20
    ( 0.5      5.0     0.1) //21
    ( 1.5      5.0     0.1) //22
    ( 5.0      5.0     0.1) //23


);

blocks
(
// Region 1 bottom left
    hex (0 1 5 4 12 13 17 16) (40 160 1) simpleGrading (0.2 0.05 1)

// Region 2 bottom center
    hex (1 2 6 5 13 14 18 17) (80 160 1) simpleGrading (5 0.05 1)

// Region 3 Bottom right
    hex (2 3 7 6 14 15 19 18) (80 160 1) simpleGrading (5 0.05 1)

// Region 4 Top left
    hex (4 5 9 8 16 17 21 20) (40 160 1) simpleGrading (0.2 20 1)

// Region 5 Top Center
    hex (5 6 10 9 17 18 22 21) (80 160 1) simpleGrading (5 20 1)

// Region 6 Top Right
    hex (6 7 11 10 18 19 23 22) (80 160 1) simpleGrading (5 20 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 12 16 4)
	    (4 16 20 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 19 15)
	    (7 11 23 19)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 12 13 1)
            (1 13 14 2)
            (2 14 15 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (8 9 21 20)
            (9 10 22 21)
	    (10 11 23 22)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
