Examples/Flat_plate_at_angle_of_attack/OpenFOAM/supersonicPlate/system/createBafflesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    plateBaffle
    {
        type        faceZone;
        zoneName    plateFacesZone;

        patches
        {
            master
            {
                name    plate_bottom;
                type    wall;
            }
            slave
            {
                name    plate_top;
                type    wall;
            }
        }
    }
}