Examples/Flat_plate_at_angle_of_attack/OpenFOAM/supersonicPlate/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    plateFaces;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.49 -0.001 -0.01) (1.51 0.001 0.11);
        }
    }
    {
        name    plateFacesZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet plateFaces;
        }
    }
);